app/controllers/ftp_servers_controller.rb

  def index
    # show the current user's ftp_server list
    @ftp_servers = current_user.ftp_servers.all
---
SELECT "ftp_servers".* FROM "ftp_servers" WHERE "ftp_servers"."user_id" = $1  [["user_id", 1]]