app/controllers/users_controller.rb

  def import_nem12
    current_time = Time.now.to_i.to_s # get the unix time
    num = 0
    if params[:files]
      params[:files].each do |file|
        case File.extname(file.original_filename)
        when '.csv'
          num += 1
          tmp_file = file.tempfile
          destiny_file = File.join('homes', current_user.name, current_time, file.original_filename)
          # Create directory
          FileUtils.mkdir_p "homes/#{current_user.name}/#{current_time}"
          # Copy the upload file into sepecific directory
          FileUtils.move tmp_file.path, destiny_file

          # call import_nem12 function in meter model to store the data in file
          Meter.import_nem12(File.dirname(destiny_file), current_user.meters.to_a)
---
SELECT "meters".* FROM "meters" INNER JOIN "billing_sites" ON "meters"."billing_site_id" = "billing_sites"."id" INNER JOIN "sites" ON "billing_sites"."site_id" = "sites"."id" WHERE "sites"."user_id" = $1  [["user_id", 1]]

  def set_user
    @user = if params[:id]
              User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]