app/views/layouts/_sidebar.html.erb

SELECT "sites".* FROM "sites" WHERE "sites"."user_id" = $1  ORDER BY "sites"."id" ASC  [["user_id", 1]]
---
        <ul class="nav nav-second-level">
          <% current_user.sites.order(:id).each do |site| %>